pulsating-flow-over-flexible-flap-3d-case2/fluid-openfoam/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "../precice-config.xml";

participant Fluid;

modules (FSI);

interfaces
{
  Interface
  {
    mesh              Fluid-Mesh;
    patches           (flap);
    locations         faceCenters;
    
    readData
    (
      DISPLACEMENTS
    );

    writeData
    (
      FORCES
    );
  };
}

FSI
{
  rho rho [1 -3 0 0 0 0 0] 1;
}